In [ ]:
#Paralel Precision LinkedIn Data Analysis

In [2]:
import pandas as pd

In [3]:
import numpy as np

In [4]:
import seaborn as sns

In [6]:
df = pd.read_csv('dux-soup-visit-data@2021-02-23 10h50.csv')

In [8]:
df.head()

,id,VisitTime,Profile,SalesProfile,Picture,Degree,First Name,Middle Name,Last Name,Connections,...,CompanyWebsite,Email,Phone,IM,Twitter,Location,Industry,My Tags,My Notes,Unnamed: 24
0,id.187999202,2021/01/15 09:41:38,https://www.linkedin.com/in/philippaartus,https://www.linkedin.com/sales/people/ACwAAAs0...,https://media-exp1.licdn.com/dms/image/C5603AQ...,3,Philippa,,Artus,1340,...,https://www.moorwand.com,,,,,"London Area, United Kingdom",Financial Services,|🦆-default-invited,NaN,NaN
1,id.28086713,2021/01/15 09:42:50,https://www.linkedin.com/in/jappy-takhar-a754a59,https://www.linkedin.com/sales/people/ACwAAAGs...,https://media-exp1.licdn.com/dms/image/C5603AQ...,3,Jappy,,Takhar,1376,...,http://www.comitfs.com,,,,,"London, England, United Kingdom",Financial Services,|🦆-default-invited,NaN,NaN
2,id.1310264,2021/01/15 09:43:39,https://www.linkedin.com/in/anjelikaklamp,https://www.linkedin.com/sales/people/ACwAAAAT...,,3,Anjelika,Klamp,Cfa,1069,...,http://www.igen-capital.com,,,,,"London, England, United Kingdom",Financial Services,|🦆-default-invited,NaN,NaN
3,id.137682286,2021/01/15 09:44:55,https://www.linkedin.com/in/henry-arundel-2ba1...,https://www.linkedin.com/sales/people/ACwAAAg0...,https://media-exp1.licdn.com/dms/image/C5603AQ...,3,Henry,,Arundel,623,...,http://www.nobleinsurance.co.uk,,,,,"London, England, United Kingdom",Financial Services,|🦆-default-invited,NaN,NaN
4,id.2726244,2021/01/15 09:46:20,https://www.linkedin.com/in/simon-freeman-830ab5,https://www.linkedin.com/sales/people/ACwAAAAp...,https://media-exp1.licdn.com/dms/image/C4D03AQ...,3,Simon,,Freeman,515,...,,,,,snowbirdfinance,"Kingston upon Thames, England, United Kingdom",Financial Services,|🦆-default-invited,NaN,NaN

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1332 entries, 0 to 1331
Data columns (total 25 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   id              1332 non-null   object
 1   VisitTime       1332 non-null   object
 2   Profile         1332 non-null   object
 3   SalesProfile    1332 non-null   object
 4   Picture         1332 non-null   object
 5   Degree          1332 non-null   object
 6   First Name      1332 non-null   object
 7   Middle Name     1332 non-null   object
 8   Last Name       1332 non-null   object
 9   Connections     1332 non-null   int64
 10  Summary         1332 non-null   object
 11  From            1332 non-null   object
 12  Title           1332 non-null   object
 13  Company         1332 non-null   object
 14  CompanyProfile  1332 non-null   object
 15  CompanyWebsite  1332 non-null   object
 16  Email           1332 non-null   object
 17  Phone           1332 non-null   object
 18  IM              1332 non-null   object
 19  Twitter         1332 non-null   object
 20  Location        1332 non-null   object
 21  Industry        1332 non-null   object
 22  My Tags         1303 non-null   object
 23  My Notes        0 non-null      float64
 24  Unnamed: 24     0 non-null      float64
dtypes: float64(2), int64(1), object(22)
memory usage: 260.3+ KB

In [10]:
First=df['Degree']=='1'

In [11]:
df[First].sample(5)

,id,VisitTime,Profile,SalesProfile,Picture,Degree,First Name,Middle Name,Last Name,Connections,...,CompanyWebsite,Email,Phone,IM,Twitter,Location,Industry,My Tags,My Notes,Unnamed: 24
1120,id.941288,2021/02/18 14:35:12,https://www.linkedin.com/in/nicolacrawford,https://www.linkedin.com/sales/people/ACwAAAAO...,https://media-exp1.licdn.com/dms/image/C4D03AQ...,1,Nicola,Crawford,Firm,21432,...,,nicola.crawford@i-riskgroup.com,,,intelligentrisk,"London, England, United Kingdom",Financial Services,|🦆-default-invited|sent blog 2,NaN,NaN
1153,id.835993490,2021/02/18 15:22:11,https://www.linkedin.com/in/hector-ramirez-642...,https://www.linkedin.com/sales/people/ACwAADHU...,,1,Hector,,Ramirez,19,...,,,,,,"City of London, England, United Kingdom",Financial Services,|🦆-default-invited|sent blog 2,NaN,NaN
1103,id.143883348,2021/02/18 14:15:44,https://www.linkedin.com/in/lrharvey,https://www.linkedin.com/sales/people/ACwAAAiT...,https://media-exp1.licdn.com/dms/image/C4D03AQ...,1,Louis-Rhys,Harvey Dipfa,Cemap,16048,...,http://www.bsqa.uk,louisrhysharveyfs@gmail.com,0208 159 2306,,LouisRhysHarvey,"London, England, United Kingdom",Financial Services,|🦆-default-invited|sent blog 2,NaN,NaN
1202,id.133369240,2021/02/18 16:27:27,https://www.linkedin.com/in/nigel-otoo-3347b938,https://www.linkedin.com/sales/people/ACwAAAfz...,https://media-exp1.licdn.com/dms/image/C5603AQ...,1,Nigel,,Otoo,38,...,,nigel.otoo@gmail.com,,,,"London Area, United Kingdom",Financial Services,|🦆-default-invited|sent blog 2,NaN,NaN
1064,id.33306917,2021/02/18 13:19:33,https://www.linkedin.com/in/markposniak,https://www.linkedin.com/sales/people/ACwAAAH8...,https://media-exp1.licdn.com/dms/image/C4E03AQ...,1,Mark,,Posniak,12859,...,http://www.octanecapital.co.uk,mark@octanecapital.co.uk,07917308692,,mposniak,"London, England, United Kingdom",Financial Services,|🦆-default-invited|sent blog 2,NaN,NaN

In [12]:
first=df[First]

In [13]:
first.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 157 entries, 209 to 1213
Data columns (total 25 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   id              157 non-null    object
 1   VisitTime       157 non-null    object
 2   Profile         157 non-null    object
 3   SalesProfile    157 non-null    object
 4   Picture         157 non-null    object
 5   Degree          157 non-null    object
 6   First Name      157 non-null    object
 7   Middle Name     157 non-null    object
 8   Last Name       157 non-null    object
 9   Connections     157 non-null    int64
 10  Summary         157 non-null    object
 11  From            157 non-null    object
 12  Title           157 non-null    object
 13  Company         157 non-null    object
 14  CompanyProfile  157 non-null    object
 15  CompanyWebsite  157 non-null    object
 16  Email           157 non-null    object
 17  Phone           157 non-null    object
 18  IM              157 non-null    object
 19  Twitter         157 non-null    object
 20  Location        157 non-null    object
 21  Industry        157 non-null    object
 22  My Tags         157 non-null    object
 23  My Notes        0 non-null      float64
 24  Unnamed: 24     0 non-null      float64
dtypes: float64(2), int64(1), object(22)
memory usage: 31.9+ KB

In [30]:
citynumbers=first.groupby('Location')['Degree'] \
                             .count() \
                             .reset_index(name='count') \
                             .sort_values(['count'], ascending=False) \
                             .head(5)

In [31]:
citynumbers

                                   Location  count
14          London, England, United Kingdom    112
13              London Area, United Kingdom     11
21                           United Kingdom      9
3   City of London, England, United Kingdom      2
25        West End, England, United Kingdom      1

In [18]:
industry=first.groupby('Industry')['Degree'] \
                             .count() \
                             .reset_index(name='count') \
                             .sort_values(['count'], ascending=False) \
                             .head(10)

In [19]:
industry

                              Industry  count
1                   Financial Services    148
0  Electrical/Electronic Manufacturing      9

In [37]:
company=first.groupby('Company')['Degree'] \
                             .count() \
                             .reset_index(name='count') \
                             .sort_values(['count'], ascending=False) \
                             .head(5)

In [38]:
company

                      Company  count
81                       HSBC      2
0    111 Security Systems LTD      1
107                   Met T&S      1
100                     METIS      1
101          MJ Hudson Meyler      1

In [39]:
title=first.groupby('Title')['Degree'] \
                             .count() \
                             .reset_index(name='count') \
                             .sort_values(['count'], ascending=False) \
                             .head(5)

In [40]:
title

                               Title  count
58                 Managing Director     46
22                          Director      8
25  Director Of Business Development      5
37                           Founder      4
39       Founder & Managing Director      2